# GetTemplate Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..GetTemplate Method
PanelScheduleView Class See Also
---
Gets the template for this view (to set the template, you must go through generateInstanceFromTemplate)
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId GetTemplate()
```

Visual Basic
---
```text
Public Function GetTemplate As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetTemplate()
```

# ### Return Value
The template id for this view
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace